import React from 'react'
type Details = {
    whatCan?: string;
    feature?: string;
    id: number;
}
export default function BusinessSenderDescription() {
    const details: Details[] = [
    {id: 19, whatCan: "হোয়াটসঅ্যাপ মার্কেটিং সফটওয়্যারটি ব্যবহার করে কি কি করা যাবে?"},
     { id: 1, feature: "কোনও টাকা ছাড়াই প্রিলোড আনলিমিটেড মেসেজ পাঠাতে পারবেন।" },
  { id: 2, feature: "মেসেজের টেক্সট এর সাথে ছবি, ভিডিও বা ফাইল যুক্ত করতে পারবেন।" },
  { id: 3, feature: "নাম্বার সেভ না করেও মেসেজ পাঠাতে পারবেন।" },
  { id: 4, feature: "একসাথে অনেককে মেসেজ পাঠাতে পারবেন।" },
  { id: 5, feature: "টার্গেট করে ক্রেতার কাছে মেসেজ পাঠাতে পারবেন।" },
  { id: 6, feature: "অটোমেটিক্যালি নতুন নাম্বার ইমপোর্ট করতে পারবেন।" },
  { id: 7, feature: "কোন নাম্বারগুলিতে হোয়াটসঅ্যাপ আছে তা ভেরিফাই করতে পারবেন।" },
  { id: 8, feature: "বিশেষ প্রয়োজন অনুযায়ী একসাথে সকল নাম্বার সংগ্রহ করতে পারবেন।" },
  { id: 9, feature: "একটি ড্যাশবোর্ড থেকে সহজে হোয়াটসঅ্যাপ নাম্বার ব্যবহার করতে পারবেন।" },
  { id: 10, feature: "টেক্সট মেসেজ এর সাথে যেকোনো মিডিয়া ফাইল পাঠাতে পারবেন।" },
  { id: 11, feature: "আপনি চাইলে প্রয়োজনমতো নির্দিষ্ট সময় পর মেসেজ পাঠাতে পারবেন।" },
  { id: 12, feature: "ছবি, ভিডিও ও ডকুমেন্ট মেসেজ ডেলিভারির সুবিধা পাবেন।" },
  { id: 13, feature: "একবারে প্রয়োজন অনুযায়ী সকল মেসেজ একসাথে পাঠাতে পারবেন।" },
  { id: 14, feature: "প্রয়োজন মতো নির্দিষ্ট সময় পর মেসেজ পাঠাতে পারবেন।" },
  { id: 15, feature: "মানুষ বিজ্ঞাপন ভালোবাসে না কিন্তু ইনবক্স ভালোবাসে। তাই বর্তমানে অনেক প্রতিষ্ঠান মেসেজ মার্কেটিং-এর ঝুঁকে পড়েছে।" },
  { id: 16, feature: "আপনি চাইলে প্রায়ই মেসেজে বিভিন্ন পণ্যের বিস্তারিত জানাতে পারবেন।" },
  { id: 17, feature: "কোনও পণ্যের বিস্তারিত জানাতে ছবি বা ভিডিও যুক্ত করে দিলে পণ্যের ব্যপারে গ্রাহকের কাছে বেশি কাজ করে।" },
  { id: 18, feature: "মোবাইল মেসেজে শুধু টেক্সট পাঠানো যায়, কিন্তু হোয়াটসঅ্যাপে আপনি টেক্সট, ছবি, ভিডিও, ফাইল সব পাঠাতে পারবেন।" },
    
  ];
  return (
    <ul className='space-y-1'>
        {
            details.map(d => (
                <div key={d.id}>
                    <p className='text-sm text-[#666]'>
                        {d.whatCan}
                    </p>
                    {
                        d.feature &&
                        (

                    <li className='flex text-sm text-[#666] gap-1'>
                        <span>◉</span>
                        <p>{d.feature}</p>
                    </li>
                        )
                    }
                </div>
            ))
        }
    </ul>
  )
}
