"use client"
import { easeInOut } from 'framer-motion'
import React from 'react'
import { motion } from 'framer-motion'

type Faqs = {
    title: string;
    description: string;
}

export default function Faq() {

    const faqs:Faqs[] = [
        {
            title: "ASTER কি? | বিস্তারিত জানতে চাই! | এটি কিভাবে কাজ করে? | ১টি পিসি’কে একসাথে একাধিক ইউজার ব্যবহার করা, এটি কিভাবে সম্ভব?",
            description: "ASTER একটি জিরো ক্লায়েন্ট মাল্টিসিট সল্যুশন যার মাধ্যমে কোনো থিন ক্লায়েন্ট বা বিশেষ কোনো হার্ডওয়্যার ছাড়াই ভার্চুয়াল ডেস্কটপ ক্লায়েন্ট তৈরি করা সম্ভব। প্রতিটি জিরো ক্লায়েন্ট একেকটি স্বতন্ত্র উইন্ডোজ কম্পিউটার এর মতো ব্যবহার করা যাবে, ব্যবহারকারী তার প্রয়োজন অনুসারে প্রতিটি ওয়ার্কপ্লেসে বিভিন্ন এপ্লিকেশন/সফটওয়্যার/প্রোগ্রাম স্বতন্ত্র ব্যবহার করতে পারবে। এটি কিভাবে কাজ করে এবং এর পেছনের টেকনোলজি নিয়ে আরো সম্যক ধারনা নিতে এখানে ক্লিক করুন।"
        },
        {
            title: "ল্যাপটপেও কি ASTER ব্যবহার করা যায়?",
            description: "ল্যাপটপে ASTER ব্যবহার করে ২-৪টি ওয়ার্কপ্লেস করা যায়। এছাড়া পর্যাপ্ত সংখ্যক মনিটর পোর্ট থাকলে যেকোনো উইন্ডোজ কম্পিউটারেই (হোক সেটি ডেস্কটপ, ল্যাপটপ, মিনি পিসি প্রভৃতি) ASTER ব্যবহার করা যাবে।"
        },
        {
            title: "আলাদা করে কোনো ডিভাইস লাগবে নাকি?",
            description: "ASTER ব্যবহার করতে বিশেষ কোনো হার্ডওয়্যার/ডিভাইস এর প্রয়োজন নেই।"
        },
        {
            title: "এটি ব্যবহার করতে কি অবিচ্ছিন্ন ইন্টারনেট বা ল্যান সংযোগ এর দরকার পড়ে?",
            description: "ASTER ব্যবহার করতে কোনো ইন্টারনেট সংযোগ এর প্রয়োজন নেই। কেবলমাত্র এটি ডাউনলোড, আপডেট ও লাইসেন্স এক্টিভেট করতে ইন্টারনেট লাগে। ASTER ওয়ার্কপ্লেস এ ব্যবহৃত মনিটরগুলো সরাসরি পিসি’র সাথে যুক্ত হয়, এতে কোনো প্রকারের ল্যান/ইথারনেট কানেকশনের প্রয়োজন পড়ে না, তাই কোনো ধরনের ডিসপ্লে লেটেন্সি নেই। যদিও আপনি চাইলে ওয়ারলেস কানেকশনের জন্য ল্যান ব্যবহার করতে পারবেন।"
        },
        {
            title: "মনে করুন, আমি ৬ টা ওয়ার্কপ্লেস করবো ১টি পিসি হতে, তাহলে আমার মনিটর-মাউস-কিবোর্ড ও অন্যান্য ডিভাইসগুলো কিভাবে কানেক্ট করবো? আমার পিসি’তে তো এতগুলো পোর্ট নাই!",
            description: "কানেকশন পদ্ধতি খুবই সহজ। আপনাকে যে যে ডিভাইসগুলো সাধারনত পিসি’র সাথে কানেক্ট করতে হবেঃ ১। মনিটর ২। মাউস-কিবোর্ড ৩। ইউএসবি পেরিফেরাল ডিভাইস ৪। অন্যান্য (প্রিন্টার, স্ক্যানার প্রভৃতি) কিভাবে এগুলো কানেক্ট করতে হয়, কানেক্ট করার জন্য পর্যাপ্ত সংখ্যক পোর্ট না থাকলে কি করবেন এবং কি কি বিষয় মাথায় রাখতে হয়, এসব বিষয়ে বিস্তারিত জানতে এখানে ক্লিক করুন।"
        },
        {
            title: "পিসি’র কনফিগারেশন কেমন লাগবে? | আমি এতসংখ্যক কম্পিউটার ASTER এর মাধ্যমে করতে চাই, পিসি’র কনফিগারেশন কি হতে হবে? | কি কি আনুষঙ্গিক কম্পোনেন্টস প্রয়োজন পড়বে, টোটাল খরচের লিস্ট দিন!",
            description: "আপনার কম্পিউটার’টি হতে আপনি কতটি ASTER ওয়ার্কপ্লেস করতে পারবেন সেটি নির্ভর করে নিম্নের দু’টি বিষয়ের উপরঃ ১। আপনার পিসি’র কনফিগারেশন ২। আপনি প্রতিটি ওয়ার্কপ্লেসে কি ধরনের ওয়ার্কলোড দিতে চান বা কি ধরনের এপ্লিকেশন/সফটওয়্যার বা প্রোগ্রাম ব্যবহার করবেন। (যেমনঃ অফিস ম্যানেজমেন্ট সফটওয়্যার, গ্রাফিক্স ডিজাইন সফটওয়্যার, ভিডিও এডিটিং সফটওয়্যার ইত্যাদি) পিসি’র কনফিগারেশন ও এ সংক্রান্ত বিস্তারিত জানতে এখানে ক্লিক করুন।"
        },
        {
            title: "ফ্রী ট্রায়াল পিরিয়ড টা দিয়ে কয়টি ওয়ার্কপ্লেস করা যাবে? এতে কি সব ফাংশনালিটি রয়েছে?",
            description: "ASTER এর ফ্রী ট্রায়াল ভার্সন টি ১৪ দিনের। ফ্রী ট্রায়াল দিয়ে আপনি ১টি পিসি হতে সর্বোচ্চ ১২টি ওয়ার্কপ্লেস সেটাপ করতে পারবেন। এটি একটি ফুল ফিচারড ট্রায়াল। এতে সব ফাংশনালিটি বিদ্যমান। ফ্রী ট্রায়াল ডাউনলোড করতে এখানে ক্লিক করুন।"
        },
        {
            title: "আমার পিসি’তে ফ্রী ট্রায়াল টি কাজ করছে না, সেক্ষেত্রে কি করবো?",
            description: "আপনি পূর্বে কখনো ASTER ইন্সটল করেছিলেন এবং ফ্রী ট্রায়াল টি এক্টিভেট করেছিলেন, যার ফলে আপনার ফ্রী ট্রায়াল পিরিয়ড টি আগেই শেষ হয়ে গিয়েছে। এমতাবস্থায় আপনার টেস্টিং যদি অপূর্ন থেকে থাকে, তাহলে আমাদের কাস্টমার সাপোর্টে আপনার সমস্যাটির ব্যাপারে যোগাযোগ করুন। প্রযোজ্যক্ষেত্রে আপনাকে এক্সটেন্ডেড ট্রায়াল লাইসেন্স ইস্যু করে দেওয়া হবে।"
        },
        {
            title: "নিজে সেটআপ করতে না পারলে আপনারা কি সেটআপ করে দিতে পারবেন?",
            description: "ASTER সেটাপ করা খুবই সহজ। আমাদের এ সংক্রান্ত ভিডিও টিউটোরিয়াল রয়েছে। আমরা রেকমেন্ড করি গ্রাহক প্রথমে নিজেই টিউটোরিয়াল দেখে সেটাপের চেষ্টা করুক, এতে গ্রাহকের পরবর্তীতে সেটাপের জন্য অন্য কারো দরকার পড়বে না। তবে গ্রাহক নিজে যদি সেটাপ করতে ব্যার্থ হন, তাহলে আমাদের টেকনিক্যাল সার্ভিস প্রতিনিধির সহায়তায় রিমোট এক্সেস এর মাধ্যমে তার সেটাপটি করিয়ে নিতে পারবেন। সাধারনত প্রথমবার সেটাপে কোনোরূপ চার্জ করা হয়না। তবে আপনার যদি একাধিক কম্পিউটারে সেটাপের প্রয়োজন হয়, সেক্ষেত্রে একটি কম্পিউটারে ফ্রী সেটাপ করে দেওয়া হবে, বাকিগুলোয় একই নিয়ম অনুসরণ করে তিনি নিজে সেটাপ করে নিবেন। সেটাপের জন্য অবশ্যই আগে টেকনিক্যাল সার্ভিস প্রতিনিধির সাথে কথা বলে শিডিউল করে নিতে হবে। সেটাপ টিউটোরিয়াল ভিডিওঃ টেকনিক্যাল সার্ভিস প্রতিনিধির সাথে কথা বলতে WhatsApp এ ম্যাসেজ করুন।"
        },
        {
            title: "আমি যে সফটওয়্যার গুলো আমার কম্পিউটারে ব্যবহার করবো সেগুলো’কি একবার ইন্সটল করলেই হয় নাকি যত’টি ওয়ার্কপ্লেস করবো, ততবার করতে হয়?",
            description: "সচরাচর ব্যবহৃত প্রায় সকল সফটওয়্যার আপনার পিসি’তে একবার ইন্সটল করলেই হয়ে যায়, প্রত্যেক ওয়ার্কপ্লেস এর জন্য আলাদা করে ইন্সটলের প্রয়োজন নেই। তবে আপনাকে যেটা করতে হবে তা হচ্ছে, প্রতিটি ওয়ার্কপ্লেস এর জন্য একটি করে উইন্ডোজ ইউজার একাউন্ট ক্রিয়েট করে নিতে হবে।"
        },
        {
            title: "আমি কি ASTER এর মাধ্যমে করা ওয়ার্কপ্লেস গুলোয় একই সফটওয়্যার বা আলাদা সফটওয়্যার ব্যবহার করতে পারবো?",
            description: "জ্বি, ASTER ওয়ার্কপ্লেস গুলো একেকটি স্বতন্ত্র উইন্ডোজ কম্পিউটারের মতো করে ব্যবহার করা যাবে। আপনার যতজন ব্যবহারকারী ততজনের জন্য আলাদা আলাদা কম্পিউটার নিলে যেভাবে ব্যবহার করতে পারতেন, ঠিক একইরকম ভাবে ASTER এর মাধ্যমে করতে পারবেন, পার্থক্য হচ্ছে আপনার কম্পিউটারের সংখ্যা কমে যাবে।"
        },
        {
            title: "এটি কি লিনাক্সে ব্যবহার করা যাবে? | কোন কোন অপারেটিং সিস্টেম সাপোর্ট করে?",
            description: "ASTER বর্তমানে শুধুমাত্র উইন্ডোজ অপারেটিং সিস্টেম (Windows 7, 8, 10, 11 ও Windows Server 2016/2019/2022) সাপোর্ট করে। ভবিষ্যতে লিনাক্স অপারেটিং সিস্টেমগুলোর জন্য আসলে তা জানতে পারবেন।"
        },
        {
            title: "হার্ডডিস্ক ম্যানেজমেন্ট কিভাবে হয়? এক ওয়ার্কপ্লেস এর ফাইলগুলো অন্য ওয়ার্কপ্লেস এর ইউজার এক্সেস নিতে পারবে কি? উইন্ডোজ ফাইল সিস্টেম কিভাবে কাজ করে?",
            description: "প্রতিটি ASTER ওয়ার্কপ্লেস এর জন্য একটি করে উইন্ডোজ ইউজার একাউন্ট ক্রিয়েট করে নিতে হয়। প্রতিটি উইন্ডোজ ইউজার একাউন্ট এর সাথে উইন্ডোজ ফাইল সিস্টেম থাকে এবং আলাদা ফোল্ডার হয়। এবং প্রতিটি ASTER ওয়ার্কপ্লেস এর স্ব স্ব উইন্ডোজ ইউজার একাউন্টে ডাটা সেইভ হয়। আপনার বর্তমান ইউজার ফোল্ডার গুলো দেখতে উইন্ডোজ ফাইল ম্যানেজার (Windows File Explorer) এ গিয়ে সার্চ বারে এটি C:\Users লিখে Enter প্রেস করুন। এ সম্পর্কে বিস্তারিত জানতে এখানে ক্লিক করুন।"
        },
        {
            title: "ASTER এর কোনো ইউজার ম্যানুয়াল বা রিসোর্স রয়েছে?",
            description: "ASTER এর বাংলাদেশি ইউজারদের জন্য আমাদের পূর্নাঙ্গ বাংলায় একটি হেল্প সেন্টার পেইজ রয়েছে। এখানে ক্লিক করুন। এছাড়া নির্মাতা প্রতিষ্ঠান IBIK Ltd. হতে তাদের তৈরিকৃত ASTER Wiki ও রয়েছে।"
        },
        {
            title: "আপনাদের কোনো ইউজার কমিউনিটি/ফোরাম/গ্রুপ আছে কি?",
            description: "আমাদের ফেইসবুকে একটি ইউজার কমিউনিটি গ্রুপ রয়েছে, যেখানে আপনি ASTER সম্পর্কে অন্যান্য ASTER ইউজারদের থেকে তাদের অভিজ্ঞতা, মতামত, সমস্যা, বিভিন্ন টিপ্স, নতুন ব্যবহারের ক্ষেত্র ও বিভিন্ন সময় আয়োজিত কমিউনিটি মেম্বারদের মধ্যে Giveaway/Contest/Special Offer নিয়ে জানতে পারবেন ও অংশ নিতে পারবেন। গ্রুপ লিংকঃ"
        },
        {
            title: "আমার প্রশ্নের উত্তর এখানে নেই। কোথায় প্রশ্ন করবো?",
            description: "আপনার প্রশ্নটি যদি এখানে না থাকে তাহলে আমাদের লাইসেন্সিং FAQs গুলো দেখুন। সেখানে খুব সম্ভবত আপনার প্রশ্নটি রয়েছে, সেখানে ASTER লাইসেন্সিং, প্রাইসিং, অর্ডার, আফটার সেলস সার্ভিস ইত্যাদি বিষয়ে প্রশ্ন-উত্তর রয়েছে। এছাড়া আর কোনো প্রশ্ন থাকলে আমাদের কাস্টমার সাপোর্টে কথা বলুন।"
        },
        {
            title: "সফটওয়্যার অর্ডার করার কতক্ষন পর লাইসেন্স কী পাবো?",
            description: "সফটওয়্যার অর্ডার করার সাথে সাথেই সফটওয়্যার ডাউনলোড করে ইনস্টল করে ফেলতে পারবেন। লাইসেন্স কী দিতে আমরা সর্বোচ্চ ২৪ ঘন্টা সময় নিয়ে থাকি।"
        },
        
    ]
  return (
    <motion.div
    className='px-6 py-8'
    initial={{opacity: 0}}
    animate={{opacity: 1}}
    transition={{duration: 1, ease: easeInOut}}
    >
        <h1 className='text-3xl text-[#333]'>
            FAQs
        </h1>
        <div className='flex flex-col gap-5 mt-2'>
            {
                faqs.map((f,i) => (
                    <div key={i} className='text-sm text-[#666]'>
                        <h3 className='p-2 font-bold bg-[#eee] rounded'>
                            {f.title}
                        </h3>
                        <p className='mt-4'>
                            {f.description}
                        </p>
                    </div>
                ))
            }
        </div>
    </motion.div>
  )
}
