import React from 'react'

export default function WhyAster() {
  return (
    <div className='px-8 py-6 text-sm text-[#666]'>
        <h1 className='text-3xl text-[#333]'>
            Aster Multiseat Software কেন ব্যবহার করবেন?
        </h1>
        <p className='mt-2'>
            ইসমাইল সাহেবের একটি কম্পিউটার ট্রেনিং সেন্টার আছে, স্টুডেন্ট ভর্তি হওয়ার সাথে সাথে তার কম্পিউটার কিনার জন্য প্রস্তুতি নিতে হয়। যা খুব ব্যায়বহুল, বর্তমানে ইসমাইল সাহেব Aster Software ব্যবহার করেই তার একটি কম্পিউটারকে ৬ টি কম্পিউটারে রুপান্তার করেছেন।
        </p>
        <p className='my-5 font-bold'>
            ASTER একটি মাল্টিসিট প্রোগ্রাম।
        </p>
        <ul className='pl-4 space-y-1 list-disc'>
            <li>
                ব্যবহারকারী মনিটর, মাউস, কিবোর্ড সংযোগের মাধ্যমে একাধিক ASTER ওয়ার্কপ্লেস তৈরি করে ফেলতে পারেন
            </li>
            <li>
                এটি একটি জিরো ক্লায়েন্ট সফটওয়্যার, কোনো থিন ক্লায়েন্ট বা বিশেষ কোনো ডিভাইস ছাড়াই ভার্চুয়াল ডেস্কটপ ক্লায়েন্ট তৈরি করতে পারছেন।
            </li>
        </ul>
        <p className='mt-6 font-bold'>
            Aster Software ব্যবহার করে কিভাবে লাভবান হবেন?
        </p>
        <ul className='pl-4 space-y-1 list-disc'>
            <li>
                ASTER ব্যবহারে যেহেতু কম্পিউটারের সংখ্যা কমিয়ে আনা যায়, তাই এক্ষেত্রে গ্রাহকের এডিশনাল কম্পিউটারগুলো কেনার যে এককালিন খরচ (upfront cost) তা কমে যাচ্ছে।
            </li>
            <li>
                প্রতিটি কম্পিউটার কুলিং সিস্টেম বজায় রাখার জন্য পিসি’তে যথেষ্ট সংখ্যক কুলিং ফ্যান থাকে। ASTER ব্যবহারের ফলে কম্পিউটার সংখ্যা কমিয়ে আনার মাধ্যমে এগুলো থেকে সৃষ্ট শব্দের মাত্রাও কমে যায়।
            </li>
            <li>
                অনেকসময় স্পেস বা জায়গা খুবই গুরুত্বপূর্ন হয়ে দাঁড়ায়, এক্ষেত্রে ASTER ব্যবহারের ফলে এডিশনাল কম্পিউটার কমানোর মাধ্যমে অনেক মূল্যবান জায়গা বাঁচানো সম্ভব হয়।
            </li>
            <li>
                ASTER ইন্সটল ও সেটাপ করতে ডিস্ক ফরমেট বা উইন্ডোজ রি-ইন্সটল করার প্রয়োজন নেই, অন্যান্য কম্পিউটার সফটওয়্যার এর মতোই ASTER ইন্সটল করা খুবই সহজ
            </li>
            <li>
                ASTER ব্যবহারের ফলে যেহেতু কম্পিউটার সংখ্যা কমিয়ে আনা যাচ্ছে, তাই স্বাভাবিকভাবেই বিদ্যুৎ খরচ অনেকাংশে কমে যাবে। এছাড়া কম্পিউটার সংখ্যা কম হওয়ার ফলে কক্ষ/রুম এর তাপমাত্রাও কম হয়, এর ফলে সেই কক্ষের এসি বা কুলিং সিস্টেম এর কম কাজ করতে হয় এবং ফলস্বরূপ বিদ্যুৎ খরচ কমে যায়।
            </li>
            <li>
               এটি ব্যবহারে কোনো ল্যান/ইথারনেট কানেকশন এর প্রয়োজন নেই, যার ফলে ওয়ার্কপ্লেসগুলোয় কোনো নেটওয়ার্ক লেটেন্সি ইস্যু’র সুযোগ নেই। 
            </li>
            <li>
                কম্পিউটার সংখ্যা কমানোর ফলে গ্রাহক মূলত ই-বর্জ্য হ্রাসে সহায়তা করছে, অর্থাৎ ASTER মাল্টিসিট সল্যুশন’টি পরিবেশ-বান্ধব
            </li>
            <li>
                অন্যান্য কম্পিউটার প্রোগ্রামের মতোই যেকোনো সময়েই ASTER কম্পিউটারে খুব সহজে ইন্সটল করা ও রিমুভ করা যায়।
            </li>
        </ul>
    </div>
  )
}
